Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # helm_release.postgresql will be updated in-place
~ resource "helm_release" "postgresql" {
      ~ force_update               = false -> true
        id                         = "postgresql"
      ~ metadata                   = [
          - {
              - app_version    = "16.3.0"
              - chart          = "postgresql"
              - first_deployed = 1765291195
              - last_deployed  = 1765294888
              - name           = "postgresql"
              - namespace      = "platform"
              - notes          = <<-EOT
                    CHART NAME: postgresql
                    CHART VERSION: 15.5.0
                    APP VERSION: 16.3.0
                    
                    ** Please be patient while the chart is being deployed **
                    
                    PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                    
                        postgresql.platform.svc.cluster.local - Read/Write connection
                    
                    To get the password for "postgres" run:
                    
                        export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace platform postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                    
                    To get the password for "vault" run:
                    
                        export POSTGRES_PASSWORD=$(kubectl get secret --namespace platform postgresql -o jsonpath="{.data.password}" | base64 -d)
                    
                    To connect to your database run the following command:
                    
                        kubectl run postgresql-client --rm --tty -i --restart='Never' --namespace platform --image docker.io/bitnami/postgresql:latest --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                          --command -- psql --host postgresql -U vault -d vault -p 5432
                    
                        > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                    
                    To connect to your database from outside the cluster execute the following commands:
                    
                        kubectl port-forward --namespace platform svc/postgresql 5432:5432 &
                        PGPASSWORD="$POSTGRES_PASSWORD" psql --host 127.0.0.1 -U vault -d vault -p 5432
                    
                    WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                    WARNING: Rolling tag detected (bitnami/postgresql:latest), please note that it is strongly recommended to avoid using rolling tags in a production environment.
                    +info https://docs.vmware.com/en/VMware-Tanzu-Application-Catalog/services/tutorials/GUID-understand-rolling-tags-containers-index.html
                    
                    ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                    
                    Substituted images detected:
                      - docker.io/bitnami/postgresql:latest
                EOT
              - revision       = 4
              - values         = jsonencode(
                    {
                      - auth         = {
                          - database = "vault"
                          - password = "CHANGE_ME"
                          - username = "vault"
                        }
                      - image        = {
                          - tag = "latest"
                        }
                      - primary      = {
                          - persistence = {
                              - enabled      = true
                              - size         = "10Gi"
                              - storageClass = "local-path-retain"
                            }
                          - resources   = {
                              - limits   = {
                                  - cpu    = "500m"
                                  - memory = "1Gi"
                                }
                              - requests = {
                                  - cpu    = "250m"
                                  - memory = "512Mi"
                                }
                            }
                        }
                      - readReplicas = {
                          - enabled = false
                        }
                    }
                )
              - version        = "15.5.0"
            },
        ] -> (known after apply)
        name                       = "postgresql"
      ~ status                     = "failed" -> "deployed"
      ~ values                     = [
          - (sensitive value),
          + (sensitive value),
        ]
        # (24 unchanged attributes hidden)
    }

  # helm_release.vault will be created
+ resource "helm_release" "vault" {
      + atomic                     = false
      + chart                      = "vault"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "vault"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.releases.hashicorp.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.31.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_ingress_v1.vault will be created
+ resource "kubernetes_ingress_v1" "vault" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt-prod"
            }
          + generation       = (known after apply)
          + name             = "vault-ingress"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "traefik"

          + rule {
              + host = "i-secrets.truealpha.club"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "vault"

                              + port {
                                  + number = 8200
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "i-secrets.truealpha.club",
                ]
              + secret_name = "vault-tls"
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://i-atlantis.truealpha.club/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`